Revit 2024 API
ParameterValuePresenceRule.Parameter Property
 The parameter which will be evaluated to pass this rule.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2020
Syntax
C#
public ElementId Parameter { get; set; }
Visual Basic
Public Property Parameter As ElementId
	Get
	Set
Visual C++
public:
property ElementId^ Parameter {
	ElementId^ get ();
	void set (ElementId^ value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
ParameterValuePresenceRule Class
Autodesk.Revit.DB Namespace